app/controllers/admin/articles_controller.rb

  def index
    @articles = Article.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `articles` ORDER BY created_at DESC LIMIT 0, 6
SELECT count(*) AS count_all FROM `articles`

  def create
    @article = Article.new(params[:article])
    if @article.save
---
INSERT INTO `articles` (`article`, `created_at`, `title`, `directory`, `updated_at`) VALUES('<p>dfgfdg</p>', '2010-04-10 10:53:17', 'fdgfd', 'Новости', '2010-04-10 10:53:17')

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 18)

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 19)
DELETE FROM `articles` WHERE `id` = 19