app/controllers/admin/cataloge_controller.rb

SELECT * FROM `product_categories` WHERE (show_slide = 1)
---
  def find_category
    @category = ProductCategory.find_by_id params[:parent_id].to_i