app/controllers/admin/company_informations_controller.rb

  def index
    @company_informations = CompanyInformation.all
---
SELECT * FROM `company_informations`