app/controllers/admin/contacts_controller.rb

SELECT * FROM `contacts`
---
  def index
    @contacts = Contact.all