app/controllers/admin/galleries_controller.rb

  def index
    @galleries = Gallery.all
---
SELECT * FROM `galleries`