app/controllers/admin/meny_items_controller.rb

SELECT * FROM `meny_items`
---
  def index
    @meny_items = MenyItem.all

SELECT * FROM `meny_items` WHERE (`meny_items`.`id` = 7)
---
  def edit
    @meny_item = MenyItem.find(params[:id])

SELECT * FROM `meny_items` WHERE (`meny_items`.`id` = 7)
---
  def update
    @meny_item = MenyItem.find(params[:id])