app/controllers/admin/orders_controller.rb

  def index
    @orders = Order.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `orders` ORDER BY created_at DESC LIMIT 0, 20
SELECT count(*) AS count_all FROM `orders`

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 100)

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 100)