app/controllers/admin/product_categories_controller.rb

SELECT * FROM `product_categories` WHERE (`product_categories`.`id` = 44) LIMIT 1
INSERT INTO `product_categories` (`created_at`, `category_photo_file_name`, `category_photo_file_size`, `category_name`, `updated_at`, `show_slide`, `parent_id`, `category_type`, `category_photo_content_type`, `description`, `category_photo_updated_at`) VALUES('2010-04-10 07:08:02', NULL, NULL, '', '2010-04-10 07:08:02', 1, 44, 'Funerals', NULL, '', NULL)
---
  def create
    @product_category = ProductCategory.new(params[:product_category])
    @product_category.parent_id = @category.id
    @category = ProductCategory.find_by_id params[:parent_id].to_i
    @product_category.category_type = @category.category_type

    if @product_category.save

SELECT * FROM `product_categories` WHERE (`product_categories`.parent_id = 56) ORDER BY category_name ASC
SELECT * FROM `products` WHERE (product_category_id IN(56))
DELETE FROM `product_categories` WHERE ((parent_id = 56))
DELETE FROM `products` WHERE ((product_category_id = 56))
---
  def destroy
    @product_category = ProductCategory.find(params[:id])
    @products = @product_category.find_all_products_by_sub_categories_ids
    if @product_category.destroy

SELECT * FROM `product_categories` WHERE (`product_categories`.`id` = 44) LIMIT 1
---
  def find_category
    @category = ProductCategory.find_by_id params[:parent_id].to_i