app/controllers/admin/products_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 21)
---
  def edit
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 21)
---
  def update
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (product_category_id IN(52,53,51)) ORDER BY created_at DESC LIMIT 0, 6
SELECT count(*) AS count_all FROM `products` WHERE (product_category_id IN(52,53,51))
---
  def show_product_table
    @products = Product.paginate :conditions => ["product_category_id IN(?)", @category.all_sub_categories_ids], :page => params[:page], :order => "created_at DESC"

SELECT * FROM `product_categories` WHERE (`product_categories`.parent_id = 51) ORDER BY category_name ASC
---
  def find_category
    @category = ProductCategory.find_by_id params[:parent_id].to_i