app/controllers/home_controller.rb

SELECT * FROM `company_informations`
SELECT * FROM `articles` WHERE (directory = 'Новости') ORDER BY created_at DESC LIMIT 0, 6
---
  def index
    @company_informations = CompanyInformation.all
    @articles = Article.by_news.paginate :page => params[:page], :order => 'created_at DESC'

SELECT * FROM `products` WHERE (product_category_id IN(44)) ORDER BY created_at DESC LIMIT 0, 6
SELECT count(*) AS count_all FROM `products` WHERE (product_category_id IN(52,53,51))
SELECT * FROM `articles` WHERE (directory = 'Ритуальные услуги') ORDER BY created_at DESC LIMIT 0, 6
---
  def funerals
    if params[:funerals_article]
      render :update do |page|
        page.redirect_to funerals_home_path
      end
    end
    unless @category.blank?
      @products = Product.paginate :conditions => ["product_category_id IN(?)", @category.all_sub_categories_ids], :page => params[:page], :order => "created_at DESC"
    else
      @funerals_news = Article.by_funerals.paginate :page => params[:page], :order => 'created_at DESC'

SELECT * FROM `articles` WHERE (directory = 'Памятники') ORDER BY created_at DESC LIMIT 0, 6
---
  def monuments
    if params[:monuments_article]
      render :update do |page|
        page.redirect_to monuments_home_path
      end
    end
    unless @category.blank?
      @products = Product.paginate :conditions => ["product_category_id IN(?)", @category.all_sub_categories_ids], :page => params[:page], :order => "created_at DESC"
    else
      @monuments_news = Article.by_monuments.paginate :page => params[:page], :order => 'created_at DESC'

SELECT * FROM `galleries`
---
  def gallery
    @galleries = Gallery.all

SELECT * FROM `contacts`
---
  def contacts
    @contacts = Contact.all

SELECT * FROM `company_informations`
---
  def company_informations
    @company_informations = CompanyInformation.all

SELECT * FROM `products` WHERE (product_category_id IN(44)) ORDER BY created_at DESC LIMIT 0, 6
SELECT count(*) AS count_all FROM `products` WHERE (product_category_id IN(52,53,51))
---
  def show_product_table
    @products = Product.paginate :conditions => ["product_category_id IN(?)", @category.all_sub_categories_ids], :page => params[:page], :order => "created_at DESC"

INSERT INTO `orders` (`address`, `city`, `region`, `created_at`, `updated_at`, `last_name`, `telephone`, `status`, `message`, `email`, `first_name`, `post_index`) VALUES('dsf', 'df', 'Волынская', '2010-04-08 06:50:19', '2010-04-08 06:50:19', 'sdfds', '324', 'Новый заказ', 'sdf', 'asdas@df.com', 'sdf', '324')
---
  def save_order
    @order = Order.new(params[:order])
    @order.known_captcha = session[:captcha]
    @order.captcha = params[:captcha]
    if @order.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 18)
---
  def show_article
    @article = Article.find(params[:id])

SELECT * FROM `product_categories` WHERE (`product_categories`.parent_id = 44) ORDER BY category_name ASC
---
  def find_category
    @category = ProductCategory.find_by_id params[:parent_id].to_i